<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used during authentication for various
    | messages that we need to display to the user. You are free to modify
    | these language lines according to your application's requirements.
    |
    */

    'failed' => 'بيانات الاعتماد هذه لا تتطابق مع سجلاتنا.',
    'password' => 'كلمة المرور المقدمة غير صحيحة.',
    'throttle' => 'عدد كبير جدًا من محاولات تسجيل الدخول. يرجى المحاولة مرة أخرى خلال :seconds ثانية.',
    'back_home' => 'العودة إلى الصفحة الرئيسية',

    // Pages
    'login' => [
        'title' => 'تسجيل الدخول',
        'description' => 'أدخل رقم هاتفك وكلمة المرور لتسجيل الدخول!',
        'forgot_password' => 'نسيت كلمة المرور؟',
        'button' => 'تسجيل الدخول',
        'dont_have_account' => 'ليس لديك حساب؟',
    ],
    'register' => [
        'title' => 'إنشاء حساب جديد',
        'description' => 'أدخل بريدك الإلكتروني وكلمة المرور للتسجيل!',
        'button' => 'إنشاء حساب جديد',
        'already_have_account' => 'لديك حساب بالفعل؟',
    ],
    'forgot_passwrod' => [
        'title' => 'نسيت كلمة المرور',
        'description' => 'هل نسيت كلمة مرورك؟ لا مشكلة. ما عليك سوى تزويدنا بعنوان بريدك الإلكتروني وسنرسل إليك رمز OTP لإعادة تعيين كلمة المرور.',
        'button' => 'إرسال رمز التوثيق (OTP)',
    ],
    'reset_password' => [
        'title' => 'إعادة تعيين كلمة المرور',
        'description' => 'أدخل كلمة المرور الجديدة!',
        'button' => 'إعادة تعيين كلمة المرور',
    ],
    'verify-otp' => [
        'title' => 'التحقق من الرمز',
        'description' => 'لقد أرسلنا رمز OTP مكون من 6 أرقام إلى بريدك الإلكتروني. يرجى إدخاله هنا.',
    ],
    'verify_email' => [
        'title' => 'تأكيد عنوان البريد الإلكتروني',
        'email_sent' => 'تم إرسال رابط تحقق جديد إلى عنوان البريد الإلكتروني الذي قدمته أثناء التسجيل.',
        'description' => 'شكرًا لتسجيلك! قبل البدء، هل يمكنك تأكيد عنوان بريدك الإلكتروني بالنقر على الرابط الذي أرسلناه إليك؟ إذا لم تستلم البريد الإلكتروني، سنكون سعداء بإرسال رابط آخر.',
        'button' => 'إعادة إرسال بريد التحقق',
    ],
    'logout' => 'تسجيل الخروج',

];
